loadTester.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 100
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "myEvent"
          data: { prop01: 799,
  prop11: 800,
  prop21: 801,
  prop31: 802,
  prop41: 803,
  prop51: 804,
  prop61: 805,
  prop71: 806,
  prop81: 807,
  prop91: 808,
  prop101: 809,
  prop111: 810,
  prop121: 811,
  prop131: 812,
  prop141: 813,
  prop151: 814,
  prop161: 815,
  prop171: 816,
  prop181: 817,
  prop191: 818,
  prop201: 819,
  prop211: 820,
  prop221: 821,
  prop231: 822,
  prop241: 823,
  prop251: 824,
  prop261: 825,
  prop271: 826,
  prop281: 827,
  prop291: 828,
  prop301: 829,
  prop311: 830,
  prop321: 831,
  prop331: 832,
  prop341: 833,
  prop351: 834,
  prop361: 835,
  prop371: 836,
  prop381: 837,
  prop391: 838,
  prop401: 839,
  prop411: 840,
  prop421: 841,
  prop431: 842,
  prop441: 843,
  prop451: 844,
  prop461: 845,
  prop471: 846,
  prop481: 847,
  prop491: 848,
  prop501: 849,
  prop511: 850,
  prop521: 851,
  prop531: 852,
  prop541: 853,
  prop551: 854,
  prop561: 855,
  prop571: 856,
  prop581: 857,
  prop591: 858,
  prop601: 859,
  prop611: 860,
  prop621: 861,
  prop631: 862,
  prop641: 863,
  prop651: 864,
  prop661: 865,
  prop671: 866,
  prop681: 867,
  prop691: 868,
  prop701: 869,
  prop711: 870,
  prop721: 871,
  prop731: 872,
  prop741: 873,
  prop751: 874,
  prop761: 875,
  prop771: 876,
  prop781: 877,
  prop791: 878,
  prop801: 879,
  prop811: 880,
  prop821: 881,
  prop831: 882,
  prop841: 883,
  prop851: 884,
  prop861: 885,
  prop871: 886,
  prop881: 887,
  prop891: 888,
  prop901: 889,
  prop911: 890,
  prop921: 891,
  prop931: 892,
  prop941: 893,
  prop951: 894,
  prop961: 895,
  prop971: 896,
  prop981: 897,
  prop991: 898,
  prop1001: 899,
  prop1011: 900,
  prop1021: 901,
  prop1031: 902,
  prop1041: 903,
  prop1051: 904,
  prop1061: 905,
  prop1071: 906,
  prop1081: 907,
  prop1091: 908,
  prop1101: 909,
  prop1111: 910,
  prop1121: 911,
  prop1131: 912,
  prop1141: 913,
  prop1151: 914,
  prop1161: 915,
  prop1171: 916,
  prop1181: 917,
  prop1191: 918,
  prop1201: 919,
  prop1211: 920,
  prop1221: 921,
  prop1231: 922,
  prop1241: 923,
  prop1251: 924,
  prop1261: 925,
  prop1271: 926,
  prop1281: 927,
  prop1291: 928,
  prop1301: 929,
  prop1311: 930,
  prop1321: 931,
  prop1331: 932,
  prop1341: 933,
  prop1351: 934,
  prop1361: 935,
  prop1371: 936,
  prop1381: 937,
  prop1391: 938,
  prop1401: 939,
  prop1411: 940,
  prop1421: 941,
  prop1431: 942,
  prop1441: 943,
  prop1451: 944,
  prop1461: 945,
  prop1471: 946,
  prop1481: 947,
  prop1491: 948,
  prop1501: 949,
  prop1511: 950,
  prop1521: 951,
  prop1531: 952,
  prop1541: 953,
  prop1551: 954,
  prop1561: 955,
  prop1571: 956,
  prop1581: 957,
  prop1591: 958,
  prop1601: 959,
  prop1611: 960,
  prop1621: 961,
  prop1631: 962,
  prop1641: 963,
  prop1651: 964,
  prop1661: 965,
  prop1671: 966,
  prop1681: 967,
  prop1691: 968 }